{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>|\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "trainable": true, "arguments": {}, "function_type": "lambda", "output_shape_type": "raw", "name": "lambda_1"}}, {"class_name": "Cropping2D", "config": {"cropping": [[70, 25], [0, 0]], "name": "cropping2d_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_row": 5, "nb_filter": 24, "init": "glorot_uniform", "trainable": true, "bias": true, "W_regularizer": null, "name": "convolution2d_1", "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null, "nb_col": 5, "activation": "relu", "b_constraint": null, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_row": 5, "nb_filter": 36, "init": "glorot_uniform", "trainable": true, "bias": true, "W_regularizer": null, "name": "convolution2d_2", "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null, "nb_col": 5, "activation": "relu", "b_constraint": null, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "nb_row": 5, "nb_filter": 48, "init": "glorot_uniform", "trainable": true, "bias": true, "W_regularizer": null, "name": "convolution2d_3", "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null, "nb_col": 5, "activation": "relu", "b_constraint": null, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_row": 3, "nb_filter": 64, "init": "glorot_uniform", "trainable": true, "bias": true, "W_regularizer": null, "name": "convolution2d_4", "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null, "nb_col": 3, "activation": "relu", "b_constraint": null, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_row": 3, "nb_filter": 64, "init": "glorot_uniform", "trainable": true, "bias": true, "W_regularizer": null, "name": "convolution2d_5", "dim_ordering": "tf", "W_constraint": null, "b_regularizer": null, "nb_col": 3, "activation": "relu", "b_constraint": null, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": 2112, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "output_dim": 100, "W_regularizer": null, "name": "dense_1", "b_regularizer": null, "W_constraint": null, "activation": "linear", "b_constraint": null}}, {"class_name": "Dense", "config": {"input_dim": 100, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "output_dim": 50, "W_regularizer": null, "name": "dense_2", "b_regularizer": null, "W_constraint": null, "activation": "linear", "b_constraint": null}}, {"class_name": "Dense", "config": {"input_dim": 50, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "output_dim": 10, "W_regularizer": null, "name": "dense_3", "b_regularizer": null, "W_constraint": null, "activation": "linear", "b_constraint": null}}, {"class_name": "Dense", "config": {"input_dim": 10, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "output_dim": 1, "W_regularizer": null, "name": "dense_4", "b_regularizer": null, "W_constraint": null, "activation": "linear", "b_constraint": null}}]}