{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "input_dtype": "float32", "output_shape": null, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>|\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 160, 320, 3], "function_type": "lambda", "trainable": true, "arguments": {}}}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "cropping": [[70, 25], [0, 0]], "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "nb_row": 5, "activation": "relu", "b_regularizer": null, "border_mode": "valid", "trainable": true, "nb_col": 5, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 24, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "nb_row": 5, "activation": "relu", "b_regularizer": null, "border_mode": "valid", "trainable": true, "nb_col": 5, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 36, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "nb_row": 5, "activation": "relu", "b_regularizer": null, "border_mode": "valid", "trainable": true, "nb_col": 5, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 48, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "nb_row": 3, "activation": "relu", "b_regularizer": null, "border_mode": "valid", "trainable": true, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "nb_row": 3, "activation": "relu", "b_regularizer": null, "border_mode": "valid", "trainable": true, "nb_col": 3, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "trainable": true, "init": "glorot_uniform", "input_dim": 2112, "W_constraint": null, "activity_regularizer": null, "output_dim": 100, "bias": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "trainable": true, "init": "glorot_uniform", "input_dim": 100, "W_constraint": null, "activity_regularizer": null, "output_dim": 50, "bias": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "trainable": true, "init": "glorot_uniform", "input_dim": 50, "W_constraint": null, "activity_regularizer": null, "output_dim": 10, "bias": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "trainable": true, "init": "glorot_uniform", "input_dim": 10, "W_constraint": null, "activity_regularizer": null, "output_dim": 1, "bias": true}}]}